Repository: montheraljodeh/alnashmi
Catalog: ENnashmi/locale/*/LC_MESSAGES/django.po
Languages: ar

source: ABOUT US
ar: عن الشركة

source: Nashmi Delivery
ar: نشمي للتوصيل

source: simply as electronic delivery which provides the best services to the customers who sign up for Nashmi Delivery.<br>Nashmi Delivery can be subdivided into various parts such as food delivery, grocery delivery, and much more.
ar: خدمه الطلب الالكتروني وتوفير افضل الغدات للزبائن عن طريق موقع نشمي . تشمل خدمة التوصيل عدة اجزاء كتوصيل الطعام وتوصيل بقالة وغيرها

source: LETTER FROM OUR
ar: رسالة من

source: CEO
ar: مدير التنفيذي

source: Read CEO letter
ar: اقرا رسالة مدير التنفيذي

source: Our Mission
ar: اهدافنا

source: To provide the highest quality of services for both delivery and transportation with the best innovative technical aspects, technology and well-trained resources.
ar: لتوفير أعلى جودة من الخدمات لكل من التوصيل والنقل مع أفضل الجوانب التقنية المبتكرة والتكنولوجيا والموارد المدربة جيدًا

source: Our Vision
ar: رؤيتنا

source: To be the preferred supplier for safe, innovative, available, fast delivery and transportation services, for everyone and everywhere around the Jordanian kingdom.
ar: أن نكون المورد المفضل لخدمات التوصيل والنقل الآمنة والمبتكرة والمتاحة والسريعة للجميع وفي جميع أنحاء المملكة الأردنية

source: COMMPANY INFO
ar: معلومات عن الشركة

source: Who's our drivers?
ar: من هم سائقينا

source: We're building a culture within ALNASHMI that emphasizes doing the right thing, period, for shoppers, drivers, and employees. Find out more about the team that's leading the way.
ar: نحن نبني ثقافة داخل شركة النشمي تؤكد على فعل الشيء الصحيح والفترة للمتسوقين والسائقين والموظفين. اكتشف المزيد عن الفريق الذي يقود الطريق

source: Who's our partners?
ar: من هم شركائنا

source: We're building a culture within ALNASHMI that emphasizes doing the right thing, period, for shoppers, drivers, and employees. Find out more about the team that's leading the way.
ar: نحن نبني ثقافة داخل شركة النشمي تؤكد على فعل الشيء الصحيح والفترة للمتسوقين والسائقين والموظفين. اكتشف المزيد عن الفريق الذي يقود الطريق

source: QUESTIONS? WE'RE
ar: أسئلة؟ نحن

source: HERE TO HELP
ar: هنا للمساعدة

source: How to download al nashmi asfar app?
ar: كيفية تحميل تطبيق النشمي اصفر؟

source: Tap the App Store or the Google Play Store.
ar: قم بزيارة متجر ابل او متجر جوجل

source: Tap the magnifying glass icon and type "Al Nashmi Asfar" into the search field.
ar: اضغط على أيقونة العدسة المكبرة واكتب النشمي اصفر في البحث

source: Seclect Alnashmi Asfar from the search results and tap Get on iPhones or install on Andriod devices.
ar: حدد النشمي اصفر من نتائج البحث واضغط على نوع المشغل الخاص بجهازك (أندرويد أو أيفون)

source: Top questions and answers
ar: أهم الأسئلة والأجوبة

source: How do i get started?
ar: كيف أبدأ؟

source: Tap the App Store or Google Play Store.
ar: قم بزيارة متجر ابل او متجر جوجل

source: Have more questions?
ar: هل لديك المزيد من الأسئلة؟

source: Contact with us by
ar: تواصل معنا عن طريق

source: Email
ar: الايميل

source: Or
ar: او

source: Phone number
ar: رقم الهاتف

source: Close
ar: اغلاق

source: CUSTOMER
ar: زبائن

source: DRIVER
ar: سائق

source: PARTNER
ar: شركاء

source: HOW IT WORKS
ar: طريقة العمل

source: In easy 3 steps
ar: بثلاث خطوات رئيسية

source: GET THE APP NOW
ar: احصل على التطبيق الان

source: Customer
ar: زبون

source: Driver
ar: سائق

source: Store
ar: محل

source: Shop Now
ar: تسوق الان

source: Drive With Us
ar: انضم لنا

source: Become a Partner
ar: كن شريكا لنا

source: hello
ar: مرحبا
